nikhildevshatwar/k3-respart-tool/baselinej721e.syscfg
sysfwResPart5.hostName                                                      = "MAIN_1_R5_0";
sysfwResPart5.Main_GPIO_Interrupt_router_count                              = 4;
sysfwResPart5.Interrupt_router_for_Main_R5F_Subsystem1_count                = 128;
sysfwResPart5.Wakeup_GPIO_Interrupt_router_count                            = 2;
sysfwResPart5.Main_NAVSS_UDMA_Interrupt_aggregator_Virtual_interrupts_count = 12;
sysfwResPart5.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count      = 256;
sysfwResPart5.Main_NAVSS_Non_secure_proxies_count                           = 4;
sysfwResPart5.Main_NAVSS_Ringacc_Free_rings_count                           = 10;
sysfwResPart5.Main_NAVSS_Ring_monitors_count                                = 3;
sysfwResPart5.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count             = 6;
sysfwResPart5.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count             = 6;
sysfwResPart5.Main_NAVSS_Interrupt_router_count                             = 28;
sysfwResPart5.MCU_NAVSS_Interrupt_aggregator_Virtual_interrupts_count       = 16;
sysfwResPart5.MCU_NAVSS_Interrupt_aggregator_Global_events_count            = 128;
sysfwResPart5.MCU_NAVSS_Non_secure_proxies_count                            = 4;
sysfwResPart5.MCU_NAVSS_Ringacc_free_rings_count                            = 8;
sysfwResPart5.MCU_NAVSS_Ring_monitors_count                                 = 3;
sysfwResPart5.MCU_NAVSS_UDMA_Rx_free_flows_count                            = 4;
sysfwResPart5.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count              = 2;
sysfwResPart5.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count              = 2;

sysfwResPart6.hostName                                                      = "MAIN_1_R5_2";
sysfwResPart6.Main_GPIO_Interrupt_router_count                              = 4;
sysfwResPart6.Interrupt_router_for_Main_R5F_Subsystem1_count                = 128;
sysfwResPart6.Wakeup_GPIO_Interrupt_router_count                            = 2;
sysfwResPart6.Main_NAVSS_UDMA_Interrupt_aggregator_Virtual_interrupts_count = 12;
sysfwResPart6.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count      = 256;
sysfwResPart6.Main_NAVSS_Non_secure_proxies_count                           = 4;
sysfwResPart6.Main_NAVSS_Ringacc_Free_rings_count                           = 10;
sysfwResPart6.Main_NAVSS_Ring_monitors_count                                = 3;
sysfwResPart6.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count             = 6;
sysfwResPart6.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count             = 6;
sysfwResPart6.Main_NAVSS_Interrupt_router_count                             = 28;
sysfwResPart6.MCU_NAVSS_Interrupt_aggregator_Virtual_interrupts_count       = 16;
sysfwResPart6.MCU_NAVSS_Interrupt_aggregator_Global_events_count            = 128;
sysfwResPart6.MCU_NAVSS_Non_secure_proxies_count                            = 4;
sysfwResPart6.MCU_NAVSS_Ringacc_free_rings_count                            = 8;
sysfwResPart6.MCU_NAVSS_Ring_monitors_count                                 = 3;
sysfwResPart6.MCU_NAVSS_UDMA_Rx_free_flows_count                            = 4;
sysfwResPart6.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count              = 2;
sysfwResPart6.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count              = 2;

sysfwResPart7.hostName                                                      = "C7X_1";
sysfwResPart7.Main_GPIO_Interrupt_router_count                              = 4;
sysfwResPart7.Wakeup_GPIO_Interrupt_router_count                            = 2;
sysfwResPart7.Main_NAVSS_UDMA_Interrupt_aggregator_Virtual_interrupts_count = 12;
sysfwResPart7.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count      = 256;
sysfwResPart7.Main_NAVSS_Non_secure_proxies_count                           = 4;
sysfwResPart7.Main_NAVSS_Ringacc_Free_rings_count                           = 32;
sysfwResPart7.Main_NAVSS_Ring_monitors_count                                = 3;
sysfwResPart7.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count             = 6;
sysfwResPart7.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count             = 6;
sysfwResPart7.Main_NAVSS_UDMA_extended_Tx_channels_count                    = 16;
sysfwResPart7.Main_NAVSS_Interrupt_router_count                             = 46;
sysfwResPart7.MCU_NAVSS_Interrupt_aggregator_Virtual_interrupts_count       = 8;
sysfwResPart7.MCU_NAVSS_Interrupt_aggregator_Global_events_count            = 64;
sysfwResPart7.MCU_NAVSS_Non_secure_proxies_count                            = 4;
sysfwResPart7.MCU_NAVSS_Ringacc_free_rings_count                            = 8;
sysfwResPart7.MCU_NAVSS_Ring_monitors_count                                 = 3;
sysfwResPart7.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count              = 2;
sysfwResPart7.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count              = 2;

sysfwResPart8.hostName                                                      = "C6X_0_1";
sysfwResPart8.Interrupt_router_for_C6X_subsystem0_count                     = 93;
sysfwResPart8.Main_GPIO_Interrupt_router_count                              = 4;
sysfwResPart8.Main_NAVSS_UDMA_Interrupt_aggregator_Virtual_interrupts_count = 12;
sysfwResPart8.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count      = 256;
sysfwResPart8.Main_NAVSS_Non_secure_proxies_count                           = 4;
sysfwResPart8.Main_NAVSS_Ringacc_Free_rings_count                           = 38;
sysfwResPart8.Main_NAVSS_Ring_monitors_count                                = 3;
sysfwResPart8.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count             = 16;
sysfwResPart8.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count             = 16;
sysfwResPart8.Main_NAVSS_UDMA_extended_Tx_channels_count                    = 6;
sysfwResPart8.Main_NAVSS_Interrupt_router_count                             = 24;
sysfwResPart8.MCU_NAVSS_Interrupt_aggregator_Virtual_interrupts_count       = 8;
sysfwResPart8.MCU_NAVSS_Interrupt_aggregator_Global_events_count            = 64;
sysfwResPart8.MCU_NAVSS_Non_secure_proxies_count                            = 4;
sysfwResPart8.MCU_NAVSS_Ringacc_free_rings_count                            = 8;
sysfwResPart8.MCU_NAVSS_Ring_monitors_count                                 = 3;
sysfwResPart8.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count              = 2;
sysfwResPart8.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count              = 2;

sysfwResPart9.hostName                                                      = "C6X_1_1";
sysfwResPart9.Interrupt_router_for_C6X_subsystem1_count                     = 93;
sysfwResPart9.Main_GPIO_Interrupt_router_count                              = 4;
sysfwResPart9.Main_NAVSS_UDMA_Interrupt_aggregator_Virtual_interrupts_count = 12;
sysfwResPart9.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count      = 256;
sysfwResPart9.Main_NAVSS_Non_secure_proxies_count                           = 4;
sysfwResPart9.Main_NAVSS_Ringacc_Free_rings_count                           = 12;
sysfwResPart9.Main_NAVSS_Ring_monitors_count                                = 3;
sysfwResPart9.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count             = 8;
sysfwResPart9.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count             = 8;
sysfwResPart9.Main_NAVSS_UDMA_extended_Tx_channels_count                    = 6;
sysfwResPart9.Main_NAVSS_Interrupt_router_count                             = 24;
sysfwResPart9.MCU_NAVSS_Interrupt_aggregator_Virtual_interrupts_count       = 8;
sysfwResPart9.MCU_NAVSS_Interrupt_aggregator_Global_events_count            = 64;
sysfwResPart9.MCU_NAVSS_Non_secure_proxies_count                            = 4;
sysfwResPart9.MCU_NAVSS_Ringacc_free_rings_count                            = 8;
sysfwResPart9.MCU_NAVSS_Ring_monitors_count                                 = 3;
sysfwResPart9.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count              = 2;
sysfwResPart9.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count              = 2;

