nikhildevshatwar/k3-respart-tool/baselinej721e.syscfg
sysfwResPart10.hostName                                                      = "MAIN_0_R5_0";
sysfwResPart10.Main_GPIO_Interrupt_router_count                              = 4;
sysfwResPart10.Interrupt_router_for_Main_R5F_Subsystem0_count                = 128;
sysfwResPart10.Wakeup_GPIO_Interrupt_router_count                            = 2;
sysfwResPart10.Main_NAVSS_UDMA_Interrupt_aggregator_Virtual_interrupts_count = 28;
sysfwResPart10.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count      = 512;
sysfwResPart10.Main_NAVSS_Non_secure_proxies_count                           = 12;
sysfwResPart10.Main_NAVSS_Ringacc_Free_rings_count                           = 182;
sysfwResPart10.Main_NAVSS_Ring_monitors_count                                = 6;
sysfwResPart10.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count             = 20;
sysfwResPart10.Main_NAVSS_UDMA_High_capacity_Rx_channels_count               = 6;
sysfwResPart10.Main_NAVSS_UDMA_Ultra_high_capacity_Rx_channels_count         = 2;
sysfwResPart10.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count             = 14;
sysfwResPart10.Main_NAVSS_UDMA_extended_Tx_channels_count                    = 132;
sysfwResPart10.Main_NAVSS_UDMA_High_capacity_Tx_channels_count               = 6;
sysfwResPart10.Main_NAVSS_UDMA_Ultra_high_capacity_Tx_channels_count         = 2;
sysfwResPart10.Main_NAVSS_Interrupt_router_count                             = 28;
sysfwResPart10.MCU_NAVSS_Interrupt_aggregator_Virtual_interrupts_count       = 24;
sysfwResPart10.MCU_NAVSS_Interrupt_aggregator_Global_events_count            = 128;
sysfwResPart10.MCU_NAVSS_Non_secure_proxies_count                            = 16;
sysfwResPart10.MCU_NAVSS_Ringacc_free_rings_count                            = 16;
sysfwResPart10.MCU_NAVSS_Ring_monitors_count                                 = 3;
sysfwResPart10.MCU_NAVSS_UDMA_Rx_free_flows_count                            = 8;
sysfwResPart10.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count              = 3;
sysfwResPart10.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count              = 3;

sysfwResPart11.hostName                                                      = "MAIN_0_R5_2";
sysfwResPart11.Main_GPIO_Interrupt_router_count                              = 4;
sysfwResPart11.Interrupt_router_for_Main_R5F_Subsystem0_count                = 128;
sysfwResPart11.Wakeup_GPIO_Interrupt_router_count                            = 2;
sysfwResPart11.Main_NAVSS_UDMA_Interrupt_aggregator_Virtual_interrupts_count = 8;
sysfwResPart11.Main_NAVSS_UDMA_Interrupt_aggregator_Global_events_count      = 256;
sysfwResPart11.Main_NAVSS_Non_secure_proxies_count                           = 4;
sysfwResPart11.Main_NAVSS_Ringacc_Free_rings_count                           = 40;
sysfwResPart11.Main_NAVSS_Ring_monitors_count                                = 3;
sysfwResPart11.Main_NAVSS_UDMA_Normal_capacity_Rx_channels_count             = 2;
sysfwResPart11.Main_NAVSS_UDMA_Normal_capacity_Tx_channels_count             = 6;
sysfwResPart11.Main_NAVSS_Interrupt_router_count                             = 28;
sysfwResPart11.MCU_NAVSS_Interrupt_aggregator_Virtual_interrupts_count       = 8;
sysfwResPart11.MCU_NAVSS_Interrupt_aggregator_Global_events_count            = 128;
sysfwResPart11.MCU_NAVSS_Non_secure_proxies_count                            = 4;
sysfwResPart11.MCU_NAVSS_Ringacc_free_rings_count                            = 8;
sysfwResPart11.MCU_NAVSS_Ring_monitors_count                                 = 3;
sysfwResPart11.MCU_NAVSS_UDMA_Rx_free_flows_count                            = 4;
sysfwResPart11.MCU_NAVSS_UDMA_Normal_capacity_Rx_channels_count              = 2;
sysfwResPart11.MCU_NAVSS_UDMA_Normal_capacity_Tx_channels_count              = 2;
